{"class_name": "Model", "keras_version": "2.0.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 33], "name": "q_left", "sparse": false}, "inbound_nodes": [], "name": "q_left"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 33], "name": "q_right", "sparse": false}, "inbound_nodes": [], "name": "q_right"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 40], "name": "a_left", "sparse": false}, "inbound_nodes": [], "name": "a_left"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 40], "name": "a_right", "sparse": false}, "inbound_nodes": [], "name": "a_right"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "int32", "output_dim": 50, "trainable": true, "embeddings_regularizer": null, "input_dim": 17023, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 33], "activity_regularizer": null, "input_length": 33}, "inbound_nodes": [[["q_left", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "int32", "output_dim": 5, "trainable": true, "embeddings_regularizer": null, "input_dim": 3, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 33], "activity_regularizer": null, "input_length": 33}, "inbound_nodes": [[["q_right", 0, 0, {}]]], "name": "embedding_2"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_3", "dtype": "int32", "output_dim": 50, "trainable": true, "embeddings_regularizer": null, "input_dim": 17023, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 40], "activity_regularizer": null, "input_length": 40}, "inbound_nodes": [[["a_left", 0, 0, {}]]], "name": "embedding_3"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_4", "dtype": "int32", "output_dim": 5, "trainable": true, "embeddings_regularizer": null, "input_dim": 3, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 40], "activity_regularizer": null, "input_length": 40}, "inbound_nodes": [[["a_right", 0, 0, {}]]], "name": "embedding_4"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 2, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["embedding_1", 0, 0, {"mask": [null, null]}], ["embedding_2", 0, 0, {"mask": [null, null]}]]], "name": "merge_1"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 2, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["embedding_3", 0, 0, {"mask": [null, null]}], ["embedding_4", 0, 0, {"mask": [null, null]}]]], "name": "merge_3"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 55, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.25, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.25, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "lstm_1"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 55, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.25, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.25, "stateful": false, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": true, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "lstm_2"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 55, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.25, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.25, "stateful": false, "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "lstm_3"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 55, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.25, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.25, "stateful": false, "recurrent_regularizer": null, "name": "lstm_4", "bias_constraint": null, "go_backwards": true, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "lstm_4"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": 2, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["lstm_1", 0, 0, {"mask": [null, null]}], ["lstm_2", 0, 0, {"mask": [null, null]}]]], "name": "merge_2"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": 2, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["lstm_3", 0, 0, {"mask": [null, null]}], ["lstm_4", 0, 0, {"mask": [null, null]}]]], "name": "merge_4"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_2", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["merge_4", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 150, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 150, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C@\u0001\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000max(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000answerRank_cnn_bilstm_tensor.pyt\u0006\u0000\u0000\u0000max_1do\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [150], "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "lambda_3"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C@\u0001\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000max(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001f\u0000\u0000\u0000answerRank_cnn_bilstm_tensor.pyt\u0006\u0000\u0000\u0000max_1do\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [150], "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "lambda_4"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["lambda_3", 0, 0, {"mask": [null, null]}], ["lambda_4", 0, 0, {"mask": [null, null]}]]], "name": "merge_5"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["merge_5", 0, 0, {}]]], "name": "dropout_5"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 301, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["q_left", 0, 0], ["q_right", 0, 0], ["a_left", 0, 0], ["a_right", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "theano"}